"use client";

import Image from "next/image";
import CoinTable from "../components/coinTable";
import DropDownButtons from "@/components/DropdownButtons";

export default function Home() {
  return (
    <div className=" mx-auto  overflow-x-hidden mb-[55px] xl:mt-[0px] md:mb-0 flex flex-col max-w-[1440px] ">
      <div className="mx-auto xl:mx-auto xl:mt-[96px] md:mt-[61px] ">
        <p className="xl:text-[40px] md:text-[30px] leading-[100%] font-iran-sans-black text-xl  text-[#000000] mt-[50px] mx-auto ">
          لیست قیمت لحظه‌ای ارزهای دیجیتال‌
        </p>
      </div>

      <DropDownButtons />


      <div className="mt-[12px] mx-[20px]  xl:mt-[41px] xl:mx-0 xl:h-[982px] md:mt-[15px] md:mx-[50px] ">
        <CoinTable />
      </div>

      <div>
        <p className=" font-iran-sans-black  text-[20px] mt-[71px] mx-[20px] md:mt-[102px] text-[#000000] xl:mt-[166px] xl:text-[24px] xl:text-right xl:mr-[150px]  md:text-[24px] md:text-right md:mx-[50px]  ">
          توضیحات کلی در مورد رمز ارزها
        </p>
      </div>
      <div>
        <p className=" text-[12px] mx-[20px] mt-[19px] xl:text-[16px]  xl:mt-[16px] xl:mx-[150px] md:mt-[25px] md:mx-[50px] md:text-[14px] font-iran-sans-regular text-[#000000]  ">
          رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای
          رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی
          را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول
          پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ
          می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را
          مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی
          دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می
          شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط
          همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت
          ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط
          ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های
          خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال
          خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله
          اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را
          در حین این انتقال دارا هستند.
        </p>
      </div>
      <div className="mx-[20px] mt-[26px] xl:mt-[66px]  xl:mx-auto md:mt-[53px] md:mx-[50px] ">
        <Image
          src="/images/g.svg"
          alt="image"
          width={335}
          height={325}
          className="w-full  xl:w-[750px] xl:h-[422px] md:w-full  "
        />
      </div>
      <div>
        <p className="mt-[40px] mx-[20px] text-[12px] xl:text-[16px] xl:mx-[150px] xl:mt-[77px] xl:mb-[94px] md:mt-[75px] md:mb-[66px] md:text-[14px] md:mx-[50px] font-iran-sans-regular text-[#000000]    ">
          رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای
          رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی
          را فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول
          پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ
          می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را
          مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی
          دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می
          شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط
          همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت
          ها کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط
          ارزهای واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های
          خاص و صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال
          خود را با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله
          اتفاق می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را
          در حین این انتقال دارا هستند.
        </p>
      </div>
    </div>
  );
}
